{"file":0,"data":1,"raw":2,"vllm":3,"10":4,"contributing":5,"md":6,"you":7,"may":8,"find":9,"information":10,"about":11,"docs":12,"ai":13,"https":14,"en":15,"latest":16,"readme":17,"markdownlint":18,"disable":19,"md001":20,"md041":21,"align":22,"center":23,"picture":24,"source":25,"media":26,"prefers":27,"color":28,"scheme":29,"dark":30,"srcset":31,"githubusercontent":32,"com":33,"project":34,"main":35,"assets":36,"logos":37,"logo":38,"text":39,"png":40,"img":41,"alt":42,"src":43,"light":44,"width":45,"55":46,"h3":47,"easy":48,"fast":49,"cheap":50,"llm":51,"serving":52,"everyone":53,"href":54,"documentation":55,"blog":56,"arxiv":57,"org":58,"abs":59,"2309":60,"06180":61,"paper":62,"vllm_project":63,"twitter":64,"discuss":65,"user":66,"forum":67,"slack":68,"developer":69,"news":70,"2025":71,"08":72,"we":73,"hosted":74,"beijing":75,"meetup":76,"mp":77,"weixin":78,"qq":79,"dgkwg1wfpwgo2jcdtqqhxa":80,"focusing":81,"large":82,"scale":83,"deployment":84,"please":85,"slides":86,"here":87,"drive":88,"google":89,"folders":90,"1pid6nsflu43dzri0eatcpgxsazdvbbqf":91,"recording":92,"www":93,"chaspark":94,"live":95,"1166916873711665152":96,"05":97,"nyc":98,"lu":99,"ma":100,"c1rqyf1f":101,"presentation":102,"1_q_aw_iomjwuimf1s1ym":103,"zhjxz8cuel0ijvaquoybea":104,"edit":105,"usp":106,"sharing":107,"now":108,"under":109,"pytorch":110,"foundation":111,"announcement":112,"welcomes":113,"01":114,"excited":115,"announce":116,"alpha":117,"release":118,"v1":119,"major":120,"architectural":121,"upgrade":122,"7x":123,"speedup":124,"clean":125,"code":126,"optimized":127,"execution":128,"loop":129,"zero":130,"overhead":131,"prefix":132,"caching":133,"enhanced":134,"multimodal":135,"support":136,"more":137,"check":138,"out":139,"our":140,"post":141,"27":142,"html":143,"details":144,"summary":145,"previous":146,"04":147,"asia":148,"day":149,"sginnovate":150,"event":151,"limited":152,"availability":153,"morning":154,"evening":155,"slots":156,"remaining":157,"inaugural":158,"from":159,"team":160,"19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo":161,"03":162,"ollama":163,"inference":164,"night":165,"16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u":166,"first":167,"china":168,"n77gibl2coratqhtveazfg":169,"1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq":170,"east":171,"coast":172,"7mu4k4xx":173,"1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs":174,"slide":175,"id":176,"g31441846c39_0_0":177,"02":178,"ninth":179,"h7g3kuj9":180,"meta":181,"1jzc_pzvxrvnsfvcw":182,"v4cfxb6pn7zz2cyp_flwo05aqg":183,"amd":184,"1zk5qejiktmlq2eqcxqzlljax3m9s7nwn":185,"view":186,"posted":187,"eighth":188,"zep56hui":189,"cloud":190,"1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4":191,"1h24phewanyrl11xy5dxubvrc9f9kkjix":192,"2024":193,"12":194,"joins":195,"ecosystem":196,"11":197,"seventh":198,"h0qvrajz":199,"snowflake":200,"1e3cxqbv3jsfgp30swyvs3em_tw":201,"ghohj9pajgk6kr54":202,"1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a":203,"have":204,"just":205,"created":206,"coordinating":207,"contributions":208,"discussing":209,"features":210,"feel":211,"free":212,"join":213,"us":214,"ray":215,"summit":216,"held":217,"special":218,"track":219,"opening":220,"talk":221,"1b_kqxphbtra_mdf":222,"tr6i8rwdou5qotznceg2mkzxehm":223,"learn":224,"talks":225,"youtube":226,"playlist":227,"list":228,"plztswpqnepxl6aqwifuwuimlpfrvpksjr":229,"other":230,"contributors":231,"users":232,"09":233,"sixth":234,"87q3nvnh":235,"nvidia":236,"1wrlgwytqfaotd5wcgspnhoaw3nq0e":237,"9wqyp7ny93xrs":238,"07":239,"fifth":240,"lp0gyjqr":241,"aws":242,"1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y":243,"partnership":244,"officially":245,"supports":246,"llama":247,"fp8":248,"quantization":249,"pipeline":250,"parallelism":251,"23":252,"llama31":253,"06":254,"fourth":255,"agivllm":256,"cloudflare":257,"bentoml":258,"1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4":259,"third":260,"robloxandvllmmeetup2024":261,"splashthat":262,"roblox":263,"1a":264,"47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem":265,"second":266,"ygxbpzhl":267,"ibm":268,"12mi2skabnuw5rbwxdyy":269,"hthth4imsnceoq10jdqbxga":270,"2023":271,"a16z":272,"1ql":273,"xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s":274,"would":275,"like":276,"express":277,"sincere":278,"gratitude":279,"andreessen":280,"horowitz":281,"30":282,"supporting":283,"open":284,"community":285,"providing":286,"generous":287,"grant":288,"development":289,"research":290,"released":291,"fastchat":292,"integration":293,"has":294,"powered":295,"lmsys":296,"vicuna":297,"chatbot":298,"arena":299,"chat":300,"since":301,"mid":302,"april":303,"use":304,"library":305,"originally":306,"developed":307,"sky":308,"computing":309,"lab":310,"cs":311,"berkeley":312,"edu":313,"uc":314,"evolved":315,"driven":316,"both":317,"academia":318,"industry":319,"state":320,"art":321,"throughput":322,"efficient":323,"management":324,"attention":325,"key":326,"value":327,"memory":328,"pagedattention":329,"20":330,"continuous":331,"batching":332,"incoming":333,"requests":334,"model":335,"cuda":336,"hip":337,"graph":338,"quantizations":339,"gptq":340,"2210":341,"17323":342,"awq":343,"2306":344,"00978":345,"autoround":346,"05516":347,"int4":348,"int8":349,"kernels":350,"including":351,"flashattention":352,"flashinfer":353,"speculative":354,"decoding":355,"chunked":356,"prefill":357,"flexible":358,"seamless":359,"popular":360,"hugging":361,"face":362,"models":363,"high":364,"various":365,"algorithms":366,"parallel":367,"sampling":368,"beam":369,"search":370,"tensor":371,"expert":372,"distributed":373,"streaming":374,"outputs":375,"openai":376,"compatible":377,"api":378,"server":379,"gpus":380,"cpus":381,"intel":382,"powerpc":383,"tpu":384,"neuron":385,"multi":386,"lora":387,"seamlessly":388,"most":389,"huggingface":390,"transformer":391,"llms":392,"mixture":393,"mixtral":394,"deepseek":395,"v2":396,"v3":397,"embedding":398,"e5":399,"mistral":400,"modal":401,"llava":402,"full":403,"supported":404,"supported_models":405,"getting":406,"started":407,"install":408,"pip":409,"getting_started":410,"installation":411,"gpu":412,"index":413,"build":414,"wheel":415,"bash":416,"visit":417,"quickstart":418,"welcome":419,"any":420,"collaborations":421,"how":422,"get":423,"involved":424,"sponsors":425,"compute":426,"resources":427,"testing":428,"following":429,"organizations":430,"thank":431,"your":432,"note":433,"sort":434,"them":435,"alphabetical":436,"order":437,"keep":438,"consistent":439,"cash":440,"donations":441,"dropbox":442,"sequoia":443,"capital":444,"skywork":445,"zhenfund":446,"alibaba":447,"anyscale":448,"crusoe":449,"databricks":450,"deepinfra":451,"lambda":452,"nebius":453,"novita":454,"replicate":455,"runpod":456,"trainy":457,"san":458,"diego":459,"sponsor":460,"also":461,"official":462,"fundraising":463,"venue":464,"through":465,"opencollective":466,"plan":467,"fund":468,"maintenance":469,"adoption":470,"citation":471,"cite":472,"bibtex":473,"inproceedings":474,"kwon2023efficient":475,"title":476,"language":477,"author":478,"woosuk":479,"kwon":480,"zhuohan":481,"li":482,"siyuan":483,"zhuang":484,"ying":485,"sheng":486,"lianmin":487,"zheng":488,"cody":489,"hao":490,"yu":491,"joseph":492,"gonzalez":493,"zhang":494,"ion":495,"stoica":496,"booktitle":497,"proceedings":498,"acm":499,"sigops":500,"29th":501,"symposium":502,"operating":503,"systems":504,"principles":505,"year":506,"contact":507,"start":508,"technical":509,"questions":510,"feature":511,"github":512,"issues":513,"fellow":514,"security":515,"disclosures":516,"advisories":517,"partnerships":518,"lists":519,"mailto":520,"end":521,"kit":522,"wish":523,"refer":524,"repo":525,"releasing":526,"releases":527,"offer":528,"reliable":529,"version":530,"base":531,"packaged":532,"binary":533,"format":534,"can":535,"conveniently":536,"accessed":537,"via":538,"pypi":539,"serve":540,"milestones":541,"communicate":542,"newly":543,"available":544,"improvements":545,"upcoming":546,"changes":547,"could":548,"affect":549,"potential":550,"breaking":551,"versioning":552,"uses":553,"right":554,"shifted":555,"where":556,"new":557,"patch":558,"every":559,"weeks":560,"contain":561,"bug":562,"fixes":563,"opposed":564,"semver":565,"contains":566,"only":567,"backwards":568,"when":569,"critical":570,"need":571,"made":572,"post1":573,"_major_":574,"milestone":575,"incompatible":576,"similar":577,"_minor_":578,"_patch_":579,"_post1_":580,"_patch":581,"1_":582,"either":583,"explicit":584,"implicit":585,"cadence":586,"bi":587,"weekly":588,"basis":589,"days":590,"after":591,"same":592,"branch":593,"all":594,"future":595,"dates":596,"below":597,"tentative":598,"optional":599,"date":600,"versions":601,"jan":602,"feb":603,"mar":604,"apr":605,"jun":606,"jul":607,"13":608,"aug":609,"14":610,"15":611,"sep":612,"16":613,"17":614,"oct":615,"18":616,"19":617,"nov":618,"21":619,"dec":620,"22":621,"each":622,"built":623,"dedicated":624,"cut":625,"performed":626,"before":627,"previously":628,"reused":629,"builds":630,"triggered":631,"push":632,"rc":633,"tag":634,"vx":635,"rc1":636,"enables":637,"test":638,"multiple":639,"rcs":640,"final":641,"does":642,"trigger":643,"used":644,"notes":645,"monitor":646,"reverts":647,"apply":648,"cherry":649,"pick":650,"criteria":651,"approach":652,"finalizing":653,"clear":654,"what":655,"picks":656,"allowed":657,"process":658,"land":659,"pr":660,"typically":661,"ensure":662,"sufficient":663,"time":664,"complete":665,"thorough":666,"round":667,"stable":668,"regression":669,"address":670,"functional":671,"performance":672,"against":673,"recent":674,"severe":675,"issue":676,"silent":677,"incorrectness":678,"compatibility":679,"crashes":680,"deadlocks":681,"leaks":682,"introduced":683,"specific":684,"change":685,"identifiers":686,"ci":687,"work":688,"prs":689,"considered":690,"merged":691,"trunk":692,"exception":693,"manual":694,"validations":695,"e2e":696,"validation":697,"perform":698,"regressions":699,"benchmark":700,"workflow":701,"actions":702,"workflows":703,"yml":704,"current":705,"coverage":706,"llama3":707,"llama4":708,"hardware":709,"h100":710,"mi300x":711,"_note":712,"based":713,"availability_":714,"step":715,"access":716,"request":717,"write":718,"repository":719,"run":720,"review":721,"setup":722,"familiarize":723,"yourself":724,"configurations":725,"tree":726,"benchmarks":727,"rocm":728,"navigate":729,"configure":730,"set":731,"v0":732,"commit":733,"hash":734,"results":735,"once":736,"completes":737,"dashboard":738,"hud":739,"reponame":740,"2fvllm":741,"corresponding":742,"comparison":743,"compare":744,"verify":745,"occurred":746,"example":747,"vs":748,"starttime":749,"thu":750,"2c":751,"2017":752,"20apr":753,"202025":754,"2021":755,"3a43":756,"3a50":757,"20gmt":758,"stoptime":759,"wed":760,"2016":761,"20jul":762,"granularity":763,"week":764,"lbranch":765,"lcommit":766,"b6553be1bc75f046b00046a4ad7576364d03c835":767,"rbranch":768,"rcommit":769,"a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f":770,"benchmarkname":771,"modelname":772,"20models":773,"backendname":774,"20backends":775,"modename":776,"20modes":777,"dtypename":778,"20dtype":779,"devicename":780,"20devices":781,"archname":782,"20platforms":783,"code_of_conduct":784,"conduct":785,"pledge":786,"members":787,"leaders":788,"make":789,"participation":790,"harassment":791,"experience":792,"regardless":793,"age":794,"body":795,"size":796,"visible":797,"invisible":798,"disability":799,"ethnicity":800,"sex":801,"characteristics":802,"gender":803,"identity":804,"expression":805,"level":806,"education":807,"socioeconomic":808,"status":809,"nationality":810,"personal":811,"appearance":812,"race":813,"caste":814,"religion":815,"sexual":816,"orientation":817,"act":818,"interact":819,"ways":820,"contribute":821,"welcoming":822,"diverse":823,"inclusive":824,"healthy":825,"standards":826,"examples":827,"behavior":828,"contributes":829,"positive":830,"environment":831,"include":832,"demonstrating":833,"empathy":834,"kindness":835,"toward":836,"people":837,"being":838,"respectful":839,"differing":840,"opinions":841,"viewpoints":842,"experiences":843,"giving":844,"gracefully":845,"accepting":846,"constructive":847,"feedback":848,"responsibility":849,"apologizing":850,"those":851,"affected":852,"mistakes":853,"learning":854,"best":855,"individuals":856,"overall":857,"unacceptable":858,"sexualized":859,"imagery":860,"advances":861,"kind":862,"trolling":863,"insulting":864,"derogatory":865,"comments":866,"political":867,"attacks":868,"public":869,"private":870,"publishing":871,"others":872,"physical":873,"email":874,"without":875,"permission":876,"which":877,"reasonably":878,"inappropriate":879,"professional":880,"setting":881,"enforcement":882,"responsibilities":883,"responsible":884,"clarifying":885,"enforcing":886,"acceptable":887,"take":888,"appropriate":889,"fair":890,"corrective":891,"action":892,"response":893,"deem":894,"threatening":895,"offensive":896,"harmful":897,"remove":898,"reject":899,"commits":900,"wiki":901,"edits":902,"aligned":903,"reasons":904,"moderation":905,"decisions":906,"scope":907,"applies":908,"within":909,"spaces":910,"individual":911,"representing":912,"using":913,"posting":914,"social":915,"account":916,"acting":917,"appointed":918,"representative":919,"online":920,"offline":921,"irl":922,"instances":923,"abusive":924,"harassing":925,"otherwise":926,"reported":927,"channel":928,"complaints":929,"reviewed":930,"investigated":931,"promptly":932,"fairly":933,"obligated":934,"respect":935,"privacy":936,"reporter":937,"incident":938,"guidelines":939,"follow":940,"impact":941,"determining":942,"consequences":943,"violation":944,"correction":945,"deemed":946,"unprofessional":947,"unwelcome":948,"consequence":949,"written":950,"warning":951,"clarity":952,"around":953,"nature":954,"explanation":955,"why":956,"apology":957,"requested":958,"single":959,"series":960,"continued":961,"interaction":962,"unsolicited":963,"specified":964,"period":965,"includes":966,"avoiding":967,"interactions":968,"well":969,"external":970,"channels":971,"violating":972,"terms":973,"lead":974,"temporary":975,"permanent":976,"ban":977,"serious":978,"sustained":979,"communication":980,"during":981,"pattern":982,"aggression":983,"disparagement":984,"classes":985,"attribution":986,"adapted":987,"contributor":988,"covenant":989,"were":990,"inspired":991,"mozilla":992,"ladder":993,"inclusion":994,"answers":995,"common":996,"see":997,"faq":998,"translations":999,"policy":1000,"reporting":1001,"report":1002,"privately":1003,"vulnerability":1004,"submission":1005,"form":1006,"triage":1007,"reports":1008,"triaged":1009,"vulnerability_management":1010,"threat":1011,"guide":1012,"usage":1013,"assumptions":1014,"recommendations":1015,"blob":1016,"securely":1017,"severity":1018,"determine":1019,"risk":1020,"taking":1021,"dealing":1022,"past":1023,"defaults":1024,"cases":1025,"categories":1026,"vulnerabilities":1027,"allow":1028,"remote":1029,"attackers":1030,"execute":1031,"arbitrary":1032,"control":1033,"system":1034,"significantly":1035,"compromise":1036,"confidentiality":1037,"integrity":1038,"privileges":1039,"needed":1040,"network":1041,"deserialization":1042,"exploit":1043,"chains":1044,"generally":1045,"rated":1046,"cvss":1047,"flaws":1048,"elevated":1049,"rce":1050,"contexts":1051,"significant":1052,"loss":1053,"require":1054,"advanced":1055,"conditions":1056,"some":1057,"trust":1058,"modes":1059,"node":1060,"privileged":1061,"required":1062,"scores":1063,"between":1064,"moderate":1065,"cause":1066,"denial":1067,"service":1068,"partial":1069,"disruption":1070,"do":1071,"breach":1072,"rating":1073,"low":1074,"minor":1075,"informational":1076,"logging":1077,"errors":1078,"non":1079,"exploitable":1080,"weaknesses":1081,"local":1082,"privilege":1083,"negligible":1084,"side":1085,"collisions":1086,"often":1087,"less":1088,"than":1089,"prenotification":1090,"certain":1091,"prenotify":1092,"vendors":1093,"ship":1094,"purpose":1095,"coordinated":1096,"notification":1097,"adding":1098,"contacts":1099,"advisory":1100,"few":1101,"added":1102,"group":1103,"send":1104,"copying":1105,"vendor":1106,"analyzed":1107,"case":1108,"withdraw":1109,"receiving":1110,"prenotifications":1111,"membership":1112,"refinements":1113,"who":1114,"included":1115,"pull_request_template":1116,"fill":1117,"description":1118,"ensuring":1119,"checklist":1120,"items":1121,"bottom":1122,"been":1123,"result":1124,"update":1125,"essential":1126,"elements":1127,"effective":1128,"fix":1129,"link":1130,"existing":1131,"resolve":1132,"command":1133,"pasting":1134,"necessary":1135,"updating":1136,"submitting":1137,"read":1138,"anything":1139,"line":1140,"removed":1141,"hide":1142,"navigation":1143,"toc":1144,"figure":1145,"markdown":1146,"span":1147,"class":1148,"60":1149,"style":1150,"strong":1151,"script":1152,"async":1153,"defer":1154,"buttons":1155,"io":1156,"js":1157,"button":1158,"show":1159,"count":1160,"true":1161,"aria":1162,"label":1163,"star":1164,"subscription":1165,"icon":1166,"octicon":1167,"eye":1168,"watch":1169,"fork":1170,"forked":1171,"depends":1172,"type":1173,"looking":1174,"recommend":1175,"starting":1176,"applications":1177,"roadmap":1178,"gaudi":1179,"accelerators":1180,"power":1181,"trainium":1182,"inferentia":1183,"announcing":1184,"intro":1185,"sosp":1186,"23x":1187,"while":1188,"reducing":1189,"p50":1190,"latency":1191,"cade":1192,"daniel":1193,"et":1194,"al":1195,"meetups":1196,"benchmarking":1197,"guides":1198,"running":1199,"tests":1200,"extensive":1201,"datasets":1202,"living":1203,"document":1204,"updated":1205,"become":1206,"dataset":1207,"overview":1208,"table":1209,"100":1210,"border":1211,"collapse":1212,"thead":1213,"tr":1214,"th":1215,"left":1216,"65":1217,"path":1218,"tbody":1219,"td":1220,"sharegpt":1221,"wget":1222,"co":1223,"anon8231489123":1224,"sharegpt_vicuna_unfiltered":1225,"sharegpt_v3_unfiltered_cleaned_split":1226,"json":1227,"sharegpt4v":1228,"image":1229,"lin":1230,"chen":1231,"sharegpt4v_instruct_gpt4":1232,"vision_cap100k":1233,"br":1234,"div":1235,"images":1236,"downloaded":1237,"separately":1238,"download":1239,"coco":1240,"train":1241,"http":1242,"cocodataset":1243,"zips":1244,"train2017":1245,"zip":1246,"burstgpt":1247,"hpmll":1248,"burstgpt_without_fails_2":1249,"csv":1250,"sonnet":1251,"deprecated":1252,"txt":1253,"random":1254,"synthetic":1255,"repetition":1256,"visionarena":1257,"lmarena":1258,"instructcoder":1259,"likaixin":1260,"aimo":1261,"mo":1262,"aime":1263,"numinamath":1264,"cot":1265,"lmms":1266,"onevision":1267,"aeala":1268,"custom":1269,"jsonl":1270,"name":1271,"should":1272,"hf":1273,"nousresearch":1274,"hermes":1275,"8b":1276,"bench":1277,"backend":1278,"endpoint":1279,"completions":1280,"num":1281,"prompts":1282,"successful":1283,"output":1284,"duration":1285,"78":1286,"total":1287,"input":1288,"tokens":1289,"1369":1290,"generated":1291,"2212":1292,"req":1293,"73":1294,"token":1295,"tok":1296,"382":1297,"89":1298,"619":1299,"85":1300,"mean":1301,"ttft":1302,"ms":1303,"71":1304,"54":1305,"median":1306,"88":1307,"p99":1308,"79":1309,"49":1310,"per":1311,"excl":1312,"1st":1313,"tpot":1314,"91":1315,"96":1316,"inter":1317,"itl":1318,"74":1319,"70":1320,"39":1321,"want":1322,"yet":1323,"even":1324,"customdataset":1325,"needs":1326,"prompt":1327,"field":1328,"entry":1329,"india":1330,"iran":1331,"vllm_use_v1":1332,"instruct":1333,"port":1334,"9001":1335,"save":1336,"detailed":1337,"skip":1338,"template":1339,"80":1340,"max":1341,"concurrency":1342,"temperature":1343,"top":1344,"75":1345,"dir":1346,"log":1347,"applying":1348,"already":1349,"vision":1350,"capability":1351,"qwen":1352,"qwen2":1353,"vl":1354,"7b":1355,"split":1356,"1000":1357,"config":1358,"method":1359,"ngram":1360,"num_speculative_tokens":1361,"prompt_lookup_max":1362,"prompt_lookup_min":1363,"2048":1364,"huggingfacedataset":1365,"subset":1366,"chart2text":1367,"cauldron":1368,"qwq":1369,"32b":1370,"seed":1371,"42":1372,"philschmid":1373,"mt":1374,"parameters":1375,"backends":1376,"client":1377,"ramp":1378,"up":1379,"rate":1380,"tool":1381,"ramping":1382,"over":1383,"useful":1384,"stress":1385,"finding":1386,"maximum":1387,"handle":1388,"given":1389,"budget":1390,"two":1391,"strategies":1392,"linear":1393,"increases":1394,"linearly":1395,"exponential":1396,"exponentially":1397,"arguments":1398,"strategy":1399,"rps":1400,"beginning":1401,"4656":1402,"00":1403,"1072":1404,"5014":1405,"1500":1406,"counts":1407,"4036":1408,"92":1409,"326":1410,"90":1411,"14527":1412,"1280":1413,"vllm_worker_multiproc_method":1414,"spawn":1415,"len":1416,"engine":1417,"104":1418,"77":1419,"23836":1420,"10477":1421,"261136":1422,"204800":1423,"adapters":1424,"dataset_path":1425,"dataset_name":1426,"loras":1427,"rank":1428,"enable":1429,"yard1":1430,"sql":1431,"structured":1432,"generation":1433,"grammar":1434,"regex":1435,"schema":1436,"python3":1437,"benchmark_serving_structured_output":1438,"py":1439,"ratio":1440,"structure":1441,"choice":1442,"xgrammar":1443,"xgrammar_bench":1444,"long":1445,"qa":1446,"question":1447,"answering":1448,"basic":1449,"benchmark_long_document_qa_throughput":1450,"documents":1451,"length":1452,"2000":1453,"50":1454,"repeat":1455,"different":1456,"mode":1457,"default":1458,"shuffle":1459,"randomly":1460,"3000":1461,"tile":1462,"entire":1463,"sequence":1464,"interleave":1465,"consecutively":1466,"efficiency":1467,"automatic":1468,"fixed":1469,"benchmark_prefix_caching":1470,"range":1471,"128":1472,"256":1473,"prefix_repetition":1474,"512":1475,"suffix":1476,"prefixes":1477,"prioritization":1478,"benchmark_prioritization":1479,"64":1480,"scheduling":1481,"priority":1482,"sequences":1483,"python":1484,"entrypoints":1485,"api_server":1486,"dtype":1487,"bfloat16":1488,"limit":1489,"mm":1490,"benchmark_serving":1491,"vllm_benchmark_results":1492,"completion":1493,"buildkite":1494,"nightly":1495,"suite":1496,"introduction":1497,"directory":1498,"sets":1499,"workload":1500,"developers":1501,"gain":1502,"whether":1503,"improves":1504,"degrades":1505,"alternatives":1506,"tgi":1507,"trt":1508,"lmdeploy":1509,"know":1510,"choose":1511,"quick":1512,"qps":1513,"a100":1514,"coming":1515,"xeon":1516,"processors":1517,"1hr":1518,"try":1519,"constraint":1520,"hr":1521,"so":1522,"won":1523,"forever":1524,"70b":1525,"8x7b":1526,"engines":1527,"5hrs":1528,"perf":1529,"ready":1530,"manually":1531,"scripts":1532,"sh":1533,"runtime":1534,"variables":1535,"on_cpu":1536,"serving_json":1537,"empty":1538,"string":1539,"latency_json":1540,"throughput_json":1541,"throughout":1542,"remote_host":1543,"ip":1544,"remote_port":1545,"descriptions":1546,"cpu":1547,"instead":1548,"one":1549,"inside":1550,"test_name":1551,"latency_llama8b_tp1":1552,"tensor_parallel_size":1553,"load_format":1554,"dummy":1555,"num_iters_warmup":1556,"num_iters":1557,"attributes":1558,"unique":1559,"identifier":1560,"must":1561,"latency_":1562,"attribute":1563,"underline":1564,"dash":1565,"specifying":1566,"convert":1567,"feeding":1568,"load":1569,"iters":1570,"warmup":1571,"numbers":1572,"highly":1573,"sensitive":1574,"sure":1575,"correctly":1576,"itself":1577,"parameter":1578,"syntax":1579,"except":1580,"fed":1581,"forward":1582,"number":1583,"slight":1584,"might":1585,"vary":1586,"lot":1587,"inf":1588,"cover":1589,"serving_llama8b_tp1_sharegpt":1590,"qps_list":1591,"server_parameters":1592,"swap_space":1593,"disable_log_stats":1594,"client_parameters":1595,"num_prompts":1596,"200":1597,"serving_":1598,"controls":1599,"compared":1600,"delay":1601,"due":1602,"randomized":1603,"still":1604,"greatly":1605,"saving":1606,"related":1607,"visualizing":1608,"helps":1609,"put":1610,"formatting":1611,"real":1612,"presented":1613,"job":1614,"page":1615,"wait":1616,"till":1617,"finish":1618,"together":1619,"attached":1620,"files":1621,"artifacts":1622,"tab":1623,"converted":1624,"generates":1625,"folder":1626,"along":1627,"benchmark_results":1628,"compares":1629,"provides":1630,"tput":1631,"passed":1632,"tp":1633,"pp":1634,"result_a":1635,"result_b":1636,"lenght":1637,"results_a":1638,"results_b":1639,"perf_ratio":1640,"142":1641,"633982":1642,"156":1643,"526018":1644,"097396":1645,"241":1646,"620334":1647,"294":1648,"018783":1649,"216863":1650,"diagram":1651,"96c":1652,"results_gnr_96c_091_tp2pp3":1653,"128c":1654,"results_gnr_128c_091_tp2pp3":1655,"1886":1656,"height":1657,"828":1658,"attachments":1659,"c02a43ef":1660,"25d0":1661,"4fd6":1662,"90e5":1663,"2169a28682dd":1664,"docker":1665,"containers":1666,"yaml":1667,"specifies":1668,"container":1669,"probe":1670,"parse":1671,"described":1672,"launch":1673,"last":1674,"collect":1675,"plot":1676,"commands":1677,"hard":1678,"coded":1679,"several":1680,"populating":1681,"requires":1682,"protobuf":1683,"tensorrt":1684,"demo":1685,"neuralmagic":1686,"git":1687,"annotation":1688,"downloading":1689,"artifact":1690,"visualization":1691,"reproduction":1692,"deploy":1693,"export":1694,"hf_token":1695,"apt":1696,"unzip":1697,"vllm_source_code_loc":1698,"aims":1699,"provide":1700,"sglang":1701,"leads":1702,"reproducible":1703,"exact":1704,"reproducing":1705,"instructions":1706,"scroll":1707,"guilde":1708,"8176":1709,"lmsysorg":1710,"cu121":1711,"openmmlab":1712,"cu12":1713,"nvcr":1714,"tritonserver":1715,"24":1716,"trtllm":1717,"py3":1718,"r24":1719,"implementation":1720,"works":1721,"going":1722,"bump":1723,"concrete":1724,"specs":1725,"8x":1726,"heavy":1727,"average":1728,"462":1729,"decode":1730,"configuration":1731,"2105":1732,"query":1733,"32":1734,"queries":1735,"sampled":1736,"arrival":1737,"patterns":1738,"determined":1739,"poisson":1740,"evaluation":1741,"metrics":1742,"higher":1743,"better":1744,"lower":1745,"known":1746,"ignore":1747,"eos":1748,"flag":1749,"batch":1750,"latency_tests_markdown_table":1751,"sample":1752,"dynamically":1753,"achieve":1754,"throughput_tests_markdown_table":1755,"means":1756,"come":1757,"values":1758,"serving_tests_markdown_table":1759,"platform":1760,"platform_markdown_table":1761,"tables":1762,"section":1763,"above":1764,"pandas":1765,"dataframes":1766,"follows":1767,"import":1768,"pd":1769,"benchmarking_results_json":1770,"benchmarking_results":1771,"loads":1772,"latency_results":1773,"dataframe":1774,"from_dict":1775,"throughput_results":1776,"serving_results":1777,"benchmarking_results_in_json_string":1778,"experiment":1779,"tools":1780,"ep_kernels":1781,"cluster":1782,"2412":1783,"19437":1784,"way":1785,"sparse":1786,"moe":1787,"many":1788,"experts":1789,"however":1790,"components":1791,"beyond":1792,"normal":1793,"package":1794,"driver":1795,"impossible":1796,"bundle":1797,"break":1798,"down":1799,"requirements":1800,"steps":1801,"libraries":1802,"pplx":1803,"ppl":1804,"deepep":1805,"dependencies":1806,"nvshmem":1807,"ibgda":1808,"root":1809,"done":1810,"host":1811,"machine":1812,"accept":1813,"positional":1814,"argument":1815,"workspace":1816,"staging":1817,"defaulting":1818,"pwd":1819,"ep_kernels_workspace":1820,"hopper":1821,"torch_cuda_arch_list":1822,"install_python_libraries":1823,"blackwell":1824,"additional":1825,"sudo":1826,"configure_system_drivers":1827,"reboot":1828,"profiler":1829,"nsys_profile_tools":1830,"gputrc2graph":1831,"processes":1832,"nsight":1833,"nsys":1834,"trace":1835,"rep":1836,"tracing":1837,"enabled":1838,"kernel":1839,"summaries":1840,"visualizations":1841,"profiling":1842,"analyzing":1843,"profile":1844,"in_file":1845,"metadata":1846,"elapsed_nonprofiled_sec":1847,"gpt":1848,"oss":1849,"ds":1850,"wall":1851,"clock":1852,"seconds":1853,"specify":1854,"elapsed":1855,"inflate":1856,"actual":1857,"entries":1858,"provided":1859,"separated":1860,"out_dir":1861,"saved":1862,"chart":1863,"nsys_cmd":1864,"assumes":1865,"installed":1866,"help":1867,"analyze":1868,"cycles":1869,"say":1870,"run1":1871,"exec":1872,"120b":1873,"collecting":1874,"profiles":1875,"aren":1876,"captured":1877,"starts":1878,"generating":1879,"again":1880,"calculate":1881,"analysis":1882,"306":1883,"produce":1884,"categorizes":1885,"names":1886,"stacked":1887,"bar":1888,"shows":1889,"mapped":1890,"substages":1891,"consist":1892,"moe_gemm":1893,"gemm":1894,"biggest":1895,"category":1896,"148":1897,"followed":1898,"attn":1899,"lets":1900,"prioritize":1901,"focus":1902,"optimizations":1903,"appended":1904,"underneath":1905,"processing":1906,"html_tbl":1907,"mapping":1908,"suppose":1909,"improving":1910,"triton":1911,"consumer":1912,"sec":1913,"perhaps":1914,"hasn":1915,"next":1916,"dive":1917,"compose":1918,"triton_poi_fused__to_copy_add_addmm_cat_":1919,"csv1":1920,"something":1921,"run2":1922,"102":1923,"stack":1924,"charts":1925,"remain":1926,"shown":1927,"another":1928,"largest":1929,"amount":1930,"difference":1931,"add":1932,"classification":1933,"abc":1934,"def":1935,"classified":1936,"engine_model":1937,"layer_anno":1938,"stage":1939,"layer":1940,"substage":1941,"mem":1942,"h_d_memops":1943,"misc":1944,"basically":1945,"dictionary":1946,"pairs":1947,"keys":1948,"bins":1949,"wishes":1950,"across":1951,"consisting":1952,"operations":1953,"leftover":1954,"invoking":1955,"infile":1956,"multi_turn":1957,"kv":1958,"cache":1959,"offloading":1960,"turn":1961,"conversations":1962,"benchmark_serving_multi_turn":1963,"found":1964,"model_name":1965,"gutenberg":1966,"ebooks":1967,"1184":1968,"utf":1969,"mv":1970,"pg1184":1971,"filename":1972,"generate_multi_turn":1973,"text_files":1974,"prefer":1975,"clients":1976,"active":1977,"conversation":1978,"turns":1979,"etc":1980,"statistics":1981,"runtime_sec":1982,"215":1983,"810":1984,"requests_per_sec":1985,"769":1986,"std":1987,"min":1988,"25":1989,"99":1990,"ttft_ms":1991,"166":1992,"67":1993,"63":1994,"45":1995,"59":1996,"94":1997,"62":1998,"26":1999,"43":2000,"69":2001,"66":2002,"353":2003,"567":2004,"tpot_ms":2005,"37":2006,"57":2007,"40":2008,"31":2009,"84":2010,"28":2011,"latency_ms":2012,"2591":2013,"1998":2014,"53":2015,"2341":2016,"2573":2017,"2860":2018,"3003":2019,"3268":2020,"46":2021,"3862":2022,"input_num_turns":2023,"input_num_tokens":2024,"2006":2025,"893":2026,"56":2027,"522":2028,"1247":2029,"2019":2030,"2718":2031,"3233":2032,"3736":2033,"3899":2034,"output_num_tokens":2035,"109":2036,"116":2037,"120":2038,"output_num_chunks":2039,"98":2040,"108":2041,"115":2042,"119":2043,"sharegpt_20230401_clean_lang_split":2044,"convert_sharegpt_to_openai":2045,"sharegpt_conv_128":2046,"standard":2047,"assistant":2048,"roles":2049,"original":2050,"auto_tune":2051,"automated":2052,"tuning":2053,"automates":2054,"optimal":2055,"combination":2056,"seqs":2057,"batched":2058,"maximize":2059,"constraints":2060,"hit":2061,"contents":2062,"prerequisites":2063,"completed":2064,"clone":2065,"desired":2066,"cd":2067,"checkout":2068,"correct":2069,"activate":2070,"conda":2071,"torch":2072,"torch_xla":2073,"customized":2074,"its":2075,"placed":2076,"accessible":2077,"variable":2078,"absolute":2079,"parent":2080,"home":2081,"served":2082,"choices":2083,"download_dir":2084,"weights":2085,"input_len":2086,"4000":2087,"output_len":2088,"max_model_len":2089,"4096":2090,"min_cache_hit_pct":2091,"percentage":2092,"max_latency_allowed_ms":2093,"milliseconds":2094,"very":2095,"100000000000":2096,"effectively":2097,"500":2098,"num_seqs_list":2099,"space":2100,"num_batched_tokens_list":2101,"1024":2102,"medium":2103,"sized":2104,"inputs":2105,"short":2106,"larger":2107,"recommended":2108,"terminal":2109,"multiplexer":2110,"tmux":2111,"screen":2112,"prevent":2113,"stopping":2114,"connection":2115,"lost":2116,"folder_of_this_script":2117,"cannot":2118,"keyword":2119,"pkill":2120,"kill":2121,"goals":2122,"goal":2123,"highest":2124,"possible":2125,"1800":2126,"requirement":2127,"500ms":2128,"assuming":2129,"finishes":2130,"timestamped":2131,"auto":2132,"yyyy_mm_dd_hh_mm":2133,"logs":2134,"vllm_log_":2135,"bm_log_":2136,"named":2137,"tested":2138,"concludes":2139,"content":2140,"a1b2c3d4":2141,"max_num_seqs":2142,"max_num_batched_tokens":2143,"request_rate":2144,"e2el":2145,"450":2146,"goodput":2147,"meet":2148,"best_max_num_seqs":2149,"best_num_batched_tokens":2150,"best_throughput":2151,"2024_08_01_10_30":2152,"row":2153,"properly":2154,"too":2155,"strict":2156,"xplane":2157,"pb":2158,"performing":2159,"systematic":2160,"utilization":2161,"determines":2162,"safe":2163,"decreasing":2164,"oom":2165,"error":2166,"launching":2167,"ensures":2168,"runs":2169,"crashing":2170,"iterate":2171,"enters":2172,"nested":2173,"iterating":2174,"aware":2175,"infinite":2176,"resulting":2177,"performs":2178,"iteratively":2179,"until":2180,"met":2181,"finds":2182,"sustainable":2183,"tracks":2184,"yielded":2185,"valid":2186,"far":2187,"collection":2188,"saves":2189,"deep":2190,"tensorboard":2191,"deepgemm":2192,"block":2193,"cutlass":2194,"currently":2195,"dense":2196,"gemms":2197,"usual":2198,"fashion":2199,"own":2200,"recursive":2201,"uv":2202,"console":2203,"benchmark_fp8_block_dense_gemm":2204,"info":2205,"__init__":2206,"207":2207,"automatically":2208,"detected":2209,"cu124":2210,"device":2211,"80gb":2212,"hbm3":2213,"fp8_utils":2214,"458":2215,"w8a8":2216,"sub":2217,"mgoin":2218,"model_executor":2219,"layers":2220,"utils":2221,"configs":2222,"7168":2223,"device_name":2224,"nvidia_h100_80gb_hbm3":2225,"fp8_w8a8":2226,"block_shape":2227,"449":2228,"18432":2229,"24576":2230,"1536":2231,"32768":2232,"16384":2233,"μs":2234,"tflops":2235,"gb":2236,"286":2237,"29":2238,"1868":2239,"1911":2240,"439":2241,"243":2242,"1933":2243,"240":2244,"1917":2245,"68":2246,"584":2247,"307":2248,"216":2249,"1718":2250,"141":2251,"222":2252,"470":2253,"1896":2254,"488":2255,"1988":2256,"670":2257,"502":2258,"279":2259,"969":2260,"635":2261,"175":2262,"687":2263,"347":2264,"335":2265,"717":2266,"275":2267,"398":2268,"39x":2269,"faster":2270,"1478":2271,"79x":2272,"slower":2273,"113":2274,"1170":2275,"61x":2276,"47":2277,"87x":2278,"171":2279,"1363":2280,"70x":2281,"1129":2282,"59x":2283,"1089":2284,"86x":2285,"38":2286,"542":2287,"77x":2288,"86":2289,"174":2290,"1386":2291,"81x":2292,"82":2293,"345":2294,"56x":2295,"144":2296,"234":2297,"946":2298,"50x":2299,"229":2300,"147":2301,"600":2302,"30x":2303,"242":2304,"248":2305,"186":2306,"37x":2307,"897":2308,"301":2309,"197":2310,"31x":2311,"463":2312,"259":2313,"131":2314,"38x":2315,"901":2316,"266":2317,"34":2318,"852":2319,"98x":2320,"14x":2321,"1677":2322,"90x":2323,"13x":2324,"81":2325,"1631":2326,"85x":2327,"36":2328,"101":2329,"822":2330,"15x":2331,"87":2332,"193":2333,"1535":2334,"199":2335,"1587":2336,"83x":2337,"41x":2338,"172":2339,"1465":2340,"51x":2341,"35x":2342,"728":2343,"34x":2344,"1532":2345,"89x":2346,"11x":2347,"192":2348,"802":2349,"32x":2350,"93":2351,"360":2352,"1454":2353,"54x":2354,"394":2355,"1608":2356,"68x":2357,"603":2358,"452":2359,"43x":2360,"331":2361,"816":2362,"534":2363,"84x":2364,"71x":2365,"198":2366,"606":2367,"88x":2368,"392":2369,"613":2370,"235":2371,"avg":2372,"310":2373,"1052":2374,"715":2375,"1076":2376,"speedups":2377,"94x":2378,"accuracy":2379,"diff":2380,"reference":2381,"000684":2382,"plugins":2383,"lora_resolvers":2384,"resolver":2385,"general":2386,"discovering":2387,"loading":2388,"loraresolver":2389,"plugin":2390,"framework":2391,"vllm_allow_runtime_lora_updating":2392,"vllm_plugins":2393,"lora_filesystem_resolver":2394,"vllm_plugin_lora_cache_dir":2395,"receives":2396,"adapter":2397,"foobar":2398,"doesn":2399,"recognize":2400,"look":2401,"subdirectory":2402,"containing":2403,"exists":2404,"kv_transfer":2405,"transfer":2406,"implements":2407,"usecase":2408,"disaggregated":2409,"prefilling":2410,"abstractions":2411,"three":2412,"pipe":2413,"fifo":2414,"transmission":2415,"apis":2416,"send_tensor":2417,"recv_tensor":2418,"lookup":2419,"buffer":2420,"caches":2421,"hidden":2422,"states":2423,"insert":2424,"drop_select":2425,"semantics":2426,"connector":2427,"connects":2428,"send_kv_caches_and_hidden_states":2429,"recv_kv_caches_and_hidden_states":2430,"enough":2431,"worker":2432,"really":2433,"naturally":2434,"handled":2435,"translate":2436,"bypassible":2437,"redis":2438,"rdma":2439,"database":2440,"adjust":2441,"flow":2442,"receive":2443,"bypass":2444,"directly":2445,"implement":2446,"bear":2447,"mind":2448,"constantly":2449,"changing":2450,"likely":2451,"broken":2452,"updates":2453,"online_serving":2454,"disaggregated_prefill":2455,"disagg_prefill_workflow":2456,"jpg":2457,"chosen":2458,"offline_inference":2459,"instance":2460,"production":2461,"training":2462,"rlhf":2463,"fine":2464,"tune":2465,"troubleshooting":2466,"outlines":2467,"consider":2468,"think":2469,"ve":2470,"discovered":2471,"3aissue":2472,"much":2473,"relevant":2474,"debugged":2475,"problem":2476,"remember":2477,"off":2478,"debugging":2479,"defined":2480,"simply":2481,"shell":2482,"avoid":2483,"lingering":2484,"settings":2485,"slow":2486,"functionalities":2487,"activated":2488,"hangs":2489,"isn":2490,"disk":2491,"internet":2492,"depend":2493,"cli":2494,"huggingface_hub":2495,"passing":2496,"isolate":2497,"pay":2498,"store":2499,"clusters":2500,"shared":2501,"filesystems":2502,"nodes":2503,"filesystem":2504,"additionally":2505,"slowing":2506,"because":2507,"frequently":2508,"swap":2509,"bottleneck":2510,"fit":2511,"adopting":2512,"options":2513,"conserving_memory":2514,"reduce":2515,"consumption":2516,"quality":2517,"changed":2518,"gh":2519,"12622":2520,"prior":2521,"came":2522,"neutral":2523,"onwards":2524,"generation_config":2525,"creator":2526,"responses":2527,"degraded":2528,"happening":2529,"trying":2530,"old":2531,"continuing":2532,"petition":2533,"produces":2534,"generations":2535,"don":2536,"solve":2537,"stuck":2538,"somewhere":2539,"debug":2540,"vllm_logging_level":2541,"vllm_log_stats_interval":2542,"tracking":2543,"queue":2544,"waiting":2545,"cuda_launch_blocking":2546,"identify":2547,"causing":2548,"nccl_debug":2549,"nccl":2550,"vllm_trace_function":2551,"record":2552,"function":2553,"calls":2554,"inspection":2555,"tell":2556,"unless":2557,"absolutely":2558,"delays":2559,"startup":2560,"incorrect":2561,"complicated":2562,"parallel_state":2563,"world_size":2564,"local_rank":2565,"distributed_init_method":2566,"tcp":2567,"xxx":2568,"54641":2569,"override":2570,"vllm_host_ip":2571,"your_ip_address":2572,"nccl_socket_ifname":2573,"your_network_interface":2574,"gloo_socket_ifname":2575,"interface":2576,"near":2577,"self":2578,"replay":2579,"captures":2580,"model_runner":2581,"cudagraph":2582,"particular":2583,"operation":2584,"causes":2585,"enforce":2586,"eager":2587,"enforce_eager":2588,"optimization":2589,"established":2590,"confirm":2591,"working":2592,"dist":2593,"init_process_group":2594,"get_rank":2595,"device_count":2596,"set_device":2597,"floattensor":2598,"all_reduce":2599,"op":2600,"reduceop":2601,"sum":2602,"synchronize":2603,"item":2604,"get_world_size":2605,"assert":2606,"expected":2607,"got":2608,"print":2609,"gloo":2610,"gloo_group":2611,"new_group":2612,"ranks":2613,"cpu_data":2614,"exit":2615,"device_communicators":2616,"pynccl":2617,"pyncclcommunicator":2618,"backward":2619,"disabled":2620,"false":2621,"stream":2622,"fill_":2623,"cuda_graph":2624,"current_stream":2625,"destroy_process_group":2626,"nproc":2627,"torchrun":2628,"nnodes":2629,"according":2630,"master_addr":2631,"master":2632,"reachable":2633,"rdzv_backend":2634,"c10d":2635,"rdzv_endpoint":2636,"successfully":2637,"message":2638,"sanity":2639,"usually":2640,"drivers":2641,"sense":2642,"administrator":2643,"further":2644,"assistance":2645,"workaround":2646,"nccl_p2p_disable":2647,"deeplearning":2648,"env":2649,"solution":2650,"distnetworkerror":2651,"dns":2652,"assign":2653,"multiprocessing":2654,"runtimeerror":2655,"seen":2656,"multiproc_worker_utils":2657,"281":2658,"initialized":2659,"looks":2660,"attempt":2661,"finished":2662,"bootstrapping":2663,"phase":2664,"probably":2665,"child":2666,"forgotten":2667,"proper":2668,"idiom":2669,"module":2670,"__name__":2671,"__main__":2672,"freeze_support":2673,"omitted":2674,"program":2675,"frozen":2676,"executable":2677,"importing":2678,"guard":2679,"behind":2680,"compile":2681,"heavily":2682,"optimize":2683,"introduces":2684,"dependency":2685,"functionality":2686,"functions":2687,"10406":2688,"simple":2689,"sin":2690,"return":2691,"randn":2692,"raises":2693,"_inductor":2694,"12219":2695,"failed":2696,"inspected":2697,"registry":2698,"_raise_for_unsupported":2699,"raise":2700,"valueerror":2701,"architectures":2702,"arch":2703,"missing":2704,"outdated":2705,"binaries":2706,"carefully":2707,"traceback":2708,"call":2709,"inspect_model_cls":2710,"typeerror":2711,"nonetype":2712,"object":2713,"iterable":2714,"resolution":2715,"model_resolution":2716,"explicitly":2717,"infer":2718,"platforms":2719,"infers":2720,"14195":2721,"unhandled":2722,"ncclcomminitrank":2723,"gpudirect":2724,"encounters":2725,"executing":2726,"init_device":2727,"deadlock":2728,"usr":2729,"lib":2730,"packages":2731,"comm":2732,"ncclcomm_t":2733,"pynccl_wrapper":2734,"277":2735,"nccl_check":2736,"_funcs":2737,"ctypes":2738,"byref":2739,"error_str":2740,"indicates":2741,"initialize":2742,"communicator":2743,"possibly":2744,"ipc_lock":2745,"linux":2746,"unmounted":2747,"dev":2748,"shm":2749,"enabling":2750,"parallelism_scaling":2751,"guidance":2752,"configuring":2753,"caused":2754,"zmq":2755,"zeromq":2756,"pyzmq":2757,"occasionally":2758,"hang":2759,"depending":2760,"6759":2761,"circumvent":2762,"1234":2763,"nccl_cumem_enable":2764,"cumem":2765,"allocator":2766,"gives":2767,"benefits":2768,"inconsistent":2769,"crash":2770,"observed":2771,"openrlhf":2772,"pull":2773,"604":2774,"discussion":2775,"5723":2776,"issuecomment":2777,"2554389656":2778,"v1_guide":2779,"deprecating":2780,"rfc":2781,"18571":2782,"gradually":2783,"share":2784,"inviter":2785,"reason":2786,"wide":2787,"independently":2788,"grew":2789,"increasingly":2790,"complex":2791,"complexity":2792,"harder":2793,"integrate":2794,"capabilities":2795,"debt":2796,"revealing":2797,"streamlined":2798,"unified":2799,"design":2800,"building":2801,"success":2802,"retains":2803,"proven":2804,"utilities":2805,"re":2806,"architects":2807,"core":2808,"covering":2809,"scheduler":2810,"manager":2811,"sampler":2812,"cohesive":2813,"maintainable":2814,"accommodates":2815,"growth":2816,"innovation":2817,"specifically":2818,"modular":2819,"hack":2820,"codebase":2821,"combine":2822,"architecture":2823,"upgrading":2824,"context":2825,"scenarios":2826,"published":2827,"important":2828,"limitations":2829,"actively":2830,"bring":2831,"therefore":2832,"progress":2833,"towards":2834,"falls":2835,"nearly":2836,"fully":2837,"planned":2838,"operational":2839,"ongoing":2840,"wip":2841,"scheduled":2842,"rfcs":2843,"delayed":2844,"temporarily":2845,"dropped":2846,"later":2847,"demand":2848,"treats":2849,"request_id":2850,"num_tokens":2851,"allocate":2852,"prefills":2853,"separation":2854,"phases":2855,"policies":2856,"fcfs":2857,"processed":2858,"assigned":2859,"tie":2860,"breaker":2861,"configurable":2862,"nobr":2863,"x86":2864,"_64":2865,"aarch64":2866,"macos":2867,"ascend":2868,"spyre":2869,"openvino":2870,"repositories":2871,"decoder":2872,"encoder":2873,"mamba":2874,"excludes":2875,"supportsv0only":2876,"protocol":2877,"tip":2878,"corresponds":2879,"column":2880,"initial":2881,"processor":2882,"12249":2883,"global":2884,"logits":2885,"13360":2886,"simultaneous":2887,"selective":2888,"mechanisms":2889,"mamba2forcausallm":2890,"mambaforcausallm":2891,"disabling":2892,"bambaforcausallm":2893,"zamba2forcausallm":2894,"nemotronhforcausallm":2895,"falconh1forcausallm":2896,"granitemoehybridforcausallm":2897,"jambaforcausallm":2898,"hybrid":2899,"minimaxtext01forcausallm":2900,"minimaxm1forcausallm":2901,"requiring":2902,"cross":2903,"separate":2904,"bartforconditionalgeneration":2905,"mllamaforconditionalgeneration":2906,"logprobs":2907,"calculation":2908,"devices":2909,"15191":2910,"spec":2911,"13414":2912,"alternative":2913,"best_of":2914,"13361":2915,"swapping":2916,"semantic":2917,"differences":2918,"returned":2919,"immediately":2920,"computed":2921,"scaling":2922,"penalty":2923,"adjustments":2924,"reflect":2925,"adjusted":2926,"probabilities":2927,"turned":2928,"recomputation":2929,"recover":2930,"upon":2931,"part":2932,"rework":2933,"legacy":2934,"pass":2935,"moving":2936,"simplified":2937,"longer":2938,"preemptions":2939,"fallbacks":2940,"communications":2941,"insecure":2942,"protected":2943,"placing":2944,"isolated":2945,"127":2946,"14579":2947,"data_parallel_master_ip":2948,"data_parallel_master_port":2949,"29500":2950,"considerations":2951,"points":2952,"intended":2953,"internal":2954,"untrusted":2955,"environments":2956,"networks":2957,"authorization":2958,"messages":2959,"sent":2960,"unencrypted":2961,"connections":2962,"accepted":2963,"anywhere":2964,"checks":2965,"isolation":2966,"segmentation":2967,"unauthorized":2968,"firewall":2969,"rules":2970,"practices":2971,"always":2972,"rather":2973,"firewalls":2974,"ports":2975,"restrict":2976,"authentication":2977,"interfaces":2978,"principle":2979,"least":2980,"protecting":2981,"exposed":2982,"designed":2983,"unsafe":2984,"services":2985,"underlying":2986,"frameworks":2987,"listening":2988,"sometimes":2989,"outside":2990,"direct":2991,"concern":2992,"leverages":2993,"initialization":2994,"creates":2995,"tcpstore":2996,"listens":2997,"protections":2998,"place":2999,"reach":3000,"perspective":3001,"intentional":3002,"protect":3003,"expose":3004,"minimum":3005,"surface":3006,"area":3007,"trusted":3008,"hosts":3009,"never":3010,"consult":3011,"application":3012,"believe":3013,"reproducibility":3014,"guarantee":3015,"sake":3016,"deterministic":3017,"vllm_enable_v1_multiprocessing":3018,"locality":3019,"almost":3020,"generators":3021,"np":3022,"manual_seed":3023,"accordingly":3024,"none":3025,"un":3026,"workers":3027,"17929":3028,"constructs":3029,"having":3030,"worry":3031,"accidentally":3032,"making":3033,"subsequent":3034,"rely":3035,"usage_stats":3036,"stats":3037,"collects":3038,"anonymous":3039,"engineering":3040,"understand":3041,"widely":3042,"allows":3043,"efforts":3044,"workloads":3045,"collected":3046,"transparent":3047,"cleaning":3048,"aggregation":3049,"publicly":3050,"benefit":3051,"usage_lib":3052,"uuid":3053,"fbe880e9":3054,"084d":3055,"4cab":3056,"a395":3057,"8984c50f1109":3058,"provider":3059,"gcp":3060,"num_cpu":3061,"cpu_type":3062,"20ghz":3063,"cpu_family_model_stepping":3064,"total_memory":3065,"101261135872":3066,"x86_64":3067,"amd64":3068,"glibc2":3069,"gpu_count":3070,"gpu_type":3071,"l4":3072,"gpu_memory_per_device":3073,"23580639232":3074,"model_architecture":3075,"optforcausallm":3076,"vllm_version":3077,"cu123":3078,"llm_class":3079,"log_time":3080,"1711663373492490000":3081,"float16":3082,"block_size":3083,"gpu_memory_utilization":3084,"null":3085,"kv_cache_dtype":3086,"enable_lora":3087,"enable_prefix_caching":3088,"disable_custom_all_reduce":3089,"preview":3090,"tail":3091,"opting":3092,"opt":3093,"vllm_no_usage_stats":3094,"do_not_track":3095,"creating":3096,"methods":3097,"mkdir":3098,"touch":3099,"exposes":3100,"health":3101,"unsloth":3102,"1b":3103,"curl":3104,"8000":3105,"iteration_tokens_total":3106,"histogram":3107,"engine_step":3108,"iteration_tokens_total_sum":3109,"iteration_tokens_total_bucket":3110,"le":3111,"definitions":3112,"escape":3113,"hatch":3114,"asked":3115,"referring":3116,"route":3117,"intfloat":3118,"baai":3119,"bge":3120,"listed":3121,"extracting":3122,"mistralai":3123,"inferior":3124,"trained":3125,"tasks":3126,"yes":3127,"variations":3128,"occur":3129,"numerical":3130,"instability":3131,"numerical_accuracy":3132,"computations":3133,"slice":3134,"differently":3135,"factors":3136,"concurrent":3137,"expansion":3138,"combined":3139,"slightly":3140,"logit":3141,"logprob":3142,"accumulate":3143,"potentially":3144,"divergence":3145,"mitigation":3146,"improved":3147,"stability":3148,"reduced":3149,"variance":3150,"float32":3151,"switching":3152,"seeds":3153,"aid":3154,"achieving":3155,"discrepancies":3156,"precision":3157,"levels":3158,"lowest":3159,"params":3160,"engine_args":3161,"env_vars":3162,"covers":3163,"conserve":3164,"preemption":3165,"regressive":3166,"times":3167,"insufficient":3168,"preempt":3169,"preempted":3170,"recomputed":3171,"becomes":3172,"occurs":3173,"33":3174,"1057":3175,"preemptionmode":3176,"recompute":3177,"increase":3178,"total_cumulative_preemption_cnt":3179,"mechanism":3180,"robustness":3181,"adversely":3182,"encounter":3183,"pre":3184,"allocates":3185,"increasing":3186,"decrease":3187,"reduces":3188,"thereby":3189,"shards":3190,"allowing":3191,"excessive":3192,"synchronization":3193,"pipeline_parallel_size":3194,"distributes":3195,"indirectly":3196,"leaving":3197,"penalties":3198,"prometheus":3199,"cumulative":3200,"smaller":3201,"chunks":3202,"improve":3203,"balancing":3204,"bound":3205,"conditionally":3206,"prioritizes":3207,"batches":3208,"pending":3209,"schedules":3210,"prioritized":3211,"locating":3212,"adjusting":3213,"fewer":3214,"decodes":3215,"8096":3216,"especially":3217,"equivalent":3218,"papers":3219,"pdf":3220,"2401":3221,"08671":3222,"2308":3223,"16369":3224,"pressure":3225,"parts":3226,"maxed":3227,"distribute":3228,"narrow":3229,"distribution":3230,"sharding":3231,"ep":3232,"specialized":3233,"deepseekv3":3234,"qwen3moe":3235,"balance":3236,"computation":3237,"enable_expert_parallel":3238,"degree":3239,"dp":3240,"replicates":3241,"beneficial":3242,"data_parallel_size":3243,"sharded":3244,"product":3245,"data_parallel_deployment":3246,"excess":3247,"capacity":3248,"3b":3249,"correspondance":3250,"repeatedly":3251,"autoprocessor":3252,"commonly":3253,"mm_processor_cache_gb":3254,"gib":3255,"completely":3256,"toc_depth":3257,"openai_compatible_server":3258,"engineargs":3259,"arg_utils":3260,"asyncengineargs":3261,"interested":3262,"truth":3263,"types":3264,"docstrings":3265,"json_tip":3266,"inc":3267,"argparse":3268,"async_engine_args":3269,"vllm_port":3270,"prefixed":3271,"vllm_":3272,"care":3273,"taken":3274,"kubernetes":3275,"conflict":3276,"capitalized":3277,"concepts":3278,"networking":3279,"envs":3280,"vars":3281,"definition":3282,"tips":3283,"doc":3284,"serves":3285,"handy":3286,"optimizing":3287,"google_tpu":3288,"sizing":3289,"selecting":3290,"ideal":3291,"chips":3292,"adequate":3293,"hbm":3294,"colab":3295,"calculator":3296,"ericehanley":3297,"rightsize":3298,"hbm_calculator":3299,"ipynb":3300,"consumed":3301,"allocated":3302,"approximately":3303,"rule":3304,"thumb":3305,